# Usage:
#   brew bundle
#   brew bundle cleanup
#   brew bundle cleanup --force

tap 'homebrew/bundle'
# tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# shell extensions
brew 'thefuck'
brew "the_silver_searcher"
brew "fzf"
brew "watch"
brew "tmux"
brew "watch"
brew "starship"

# misc
brew "fish"
brew "git"
brew "jq"
brew "vim"
brew "neovim"

# language support
brew "pyenv"
brew "rbenv"
brew "nvm"

# dbs
brew "sqlite"
brew "postgresql"

#k8s
brew "kube-ps1"
brew "kubectx"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "stern"

# aws
brew "awscli"
brew "aws-iam-authenticator"

# utils
brew "jq"

# Cask
cask "iterm2"
cask "clipy"
cask "docker"
cask "meetingbar"
cask "chrome"
cask "firefox"