# Usage:
#   brew bundle
#   brew bundle cleanup
#   brew bundle cleanup --force

tap 'homebrew/bundle'
# tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# shell extensions
brew 'thefuck'
brew "the_silver_searcher"
brew "fzf"
brew "watch"
brew "tmux"

# misc
brew "fish"
brew "git"
brew "jq"
brew "vim"
brew "neovim"

# language support
brew "pyenv"
brew "rbenv"
brew "nvm"

# dbs
brew "sqlite"
brew "postgresql"

# Cask
cask "clipy"
