# Usage:
#   brew bundle
#   brew bundle cleanup
#   brew bundle cleanup --force

tap 'homebrew/bundle'
# tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# shell extensions
brew 'thefuck'
brew "the_silver_searcher"
brew "fzf"
brew "watch"
brew "tmux"
brew "watch"
brew "starship"

# misc
brew "fish"
brew "git"
brew "jq"
brew "vim"
brew "neovim"
brew "direnv"
brew "gpg"

# language support
brew "pyenv"
brew "rbenv"
brew "nvm"

# dbs
brew "sqlite"
brew "postgresql"

#k8s
brew "kube-ps1"
brew "kubectx"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "stern"

# aws
brew "awscli"
brew "aws-iam-authenticator"

# tools from https://github.com/ibraheemdev/modern-unix
tap "cantino/mcfly"
tap "clementtsang/bottom"
brew "bat"
brew "exa"
brew "lsd"
brew "git-delta"
brew "dust"
brew "duf"
brew "broot"
brew "fd"
brew "mcfly"
brew "ripgrep"
brew "the_silver_searcher"
brew "fzf"
brew "choose-rust"
brew "jq"
brew "sd"
brew "bottom"
brew "glances"
brew "hyperfine"
brew "gping"
brew "procs"
brew "httpie"
brew "curlie"
brew "xh"
brew "zoxide"
brew "dog"

# Cask
cask "iterm2"
cask "clipy"
cask "docker"
cask "meetingbar"
cask "google-chrome"
cask "firefox"
cask "visual-studio-code"
